system/myCustomFunction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

myFastInterfaceHeight
{
    type coded;
    libs (utilityFunctionObjects);
    name fastInterfaceHeight;

    XMIN 0.0;
    XMAX 8.0;
    DX 0.06928203230275509; // sqrt(3)/2*0.08
    DY 0.04;                // 0.08/2
    NROWS 1;

    codeExecute
    #{
        // read mesh 
        const fvMesh& m = mesh();
        const scalar zmax = m.bounds().max().z();

        // array of probe x locations
        label lower = floor(-($XMIN) / $DX) - 1;
        label upper = floor(  $XMAX  / $DX);
        label Nx = lower + upper + 1;
        scalarList xvec(Nx);
        for (label i = 0; i < Nx; ++i)
        {
            xvec[i] = (i - lower - 0.5) * $DX;
        }
        // array of probe y locations
        label Ny = 2 * $NROWS;
        scalarList yvec(Ny);
        for (label i = 0; i < Ny; ++i)
        {
            yvec[i] = i * $DY + 0.02;
        }

        // initialize file
        mkDir("postProcessing");
        static std::ofstream outFile("postProcessing/height.csv", std::ios::app);

        // Write time from master process
        if (Pstream::master()) outFile << m.time().value();

        // Get alpha field
        const volScalarField& alpha = m.lookupObject<volScalarField>("alpha.water");

        // define lambda function 
        auto alphaCrossing = [&](scalar x, scalar y) -> scalar
        {
            // start from top position 
            vector pos(x + 1e-6, y + 1e-6, zmax);
            label c = m.findCell(pos); 
            if (c == -1) return 0.0;

            scalar iso = 0.5;               // find iso surface value 
            scalar ai = alpha[c];
            scalar zi = m.C()[c].z();

            while (true)
            {
                // new alpha and z value 
                scalar a = alpha[c];
                scalar z = m.C()[c].z();

                // if sign change from ai to a 
                if ((ai - iso)*(a - iso) < 0)
                {
                    // linear interpolation 
                    scalar t = (iso - ai)/(a - ai);
                    return zi + t * (z - zi);
                }

                // find bottom neighbour
                const labelList& neighbour = m.cellCells()[c];
                bool stepped = false;
                for (label n: neighbour)
                {
                    if (m.C()[n].z() < z - 1e-6)
                    {
                        ai = a;
                        zi = z;
                        c = n;
                        pos.z() = z;
                        stepped = true;
                        break;
                    }
                }
                // no bottom neighbour found
                if (!stepped) return 0.0;
            }
        };

        for (label j = 0; j < Nx; ++j)
        {
            scalar height = 0.0;
            
            for (label i = 0; i < Ny; ++i)
            {
                // sample at probe location
                height += alphaCrossing(xvec[j], yvec[i]) / Ny;
            }

            // Sum across all processors
            reduce(height, sumOp<scalar>());

            // write value if master process
            if (Pstream::master()) outFile << "," << height;
        }

        if (Pstream::master()) outFile << "\n";
    #};
}

// ************************************************************************* //